use Tal_MyBase


----------------------------------------------------------
Create view [Заказы]
			as Select Наименование_товара [Товар],
		Количество [Кол-во],
		Дата_сделки[Дата] from Сделка;

select * from [Заказы]

drop view [Заказы]

----------------------------------------------------------------------

create view [Дорогие товары](Наименование_товара, Цена, Количество_ячеек)
		as select Наименование_товара, Цена, Количество_ячеек from Товары_
		where Цена >310;

select * from [Дорогие товары]

----drop view [Дорогие товары]

----------------------------------------------------------------------
----------------------------------------------------------------------

alter view [Дорогие товары](Наименование_товара, Цена, Количество_ячеек)
		as select Наименование_товара, Цена, Количество_ячеек from Товары_
		where Цена >310 with check option;

select * from [Дорогие товары]

drop view [Дорогие товары]

----------------------------------------------------------------------

create view [Сделка_view] 
			as select Номер_сделки[Номер Сделки],
					Наименование_товара[Наименование_товара], 
					Покупатель[Покупатель], 
					Количество[Кол-во], 
					Дата_сделки[Дата]
			from Сделка
where Количество > 8 with check option

select * from [Сделка_view]

insert into Покупатель  values('Цех №3','+375111111111','ул. Свердлова, д.8')
insert into Покупатель  values('Цех №4','+375111111111','ул. Свердлова, д.8')

insert into [Сделка_view] values (9,'Машинка для покраски',  'Цех №3', 54, '2018-10-10')
insert [Сделка_view] values (10,'Цилиндровочный аппарат', 'Цех №4', 11, '2018-10-18')

drop view [Сделка_view]


----------------------------------------------------------------------


